# Сообщения для пользователя

MSG1 = 'Добро пожаловать в заметки!'
MSG2 = "\nЗаметки содержат идентификатор, заголовок, тело заметки и дату/время создания или последнего изменения заметки\n\
Вы находитесь в основном меню.\n\
Для перехода в меню действий с данными введите '1',\n\
Для выхода из программы введите '0'.\n\
Ввод: "
MSG3 = '\nВведите заголовок: '
MSG4 = 'Введите описание: '
MSG5 = '\nВведите искомые данные: '
MSG6 = '\nСправочник не существует, возможно, он не был создан или был удален'
MSG7 = "\nВы находитесь в меню действий с данными.\n\
Для создания заметки введите '1',\n\
Для поиска данных введите '2',\n\
Для вывода всех заметок введите '3'.\n\
Для замены данных введите '4'.\n\
Для удаления заметок '5'.\n\
Для выхода в основное меню введите '0'.\n\
Ввод: "
MSG8 = "|------------------------------------------------------------------------------|"
MSG9 = '\nВсего доброго!'
MSG13 = '\nВведите Новое название: '
MSG11 = '\nВведите Новую заметку: '
MSG12 = '\nВведите ID заметки, которую необходимо удалить: '
MSG10 = '\nВведите ID заметки: '